tutorials/tutorial_08/app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    @posts = Post.all